//Session
export const サービスの利用を開始する = "サービスの利用を開始する";
export const プロフィールを取得する = "プロフィールを取得する";
export const 所属組織一覧を取得する = "所属組織一覧を取得する";
export const 自分のプロジェクト一覧を取得する = "自分のプロジェクト一覧を取得する";
export const 新しいプロジェクトを追加する = "新しいプロジェクトを追加する";
export const プロジェクトを更新する = "プロジェクトを更新する";
export const プロジェクトをクローズする = "プロジェクトをクローズする";

// Backlog
export const 自分のタスク一覧を取得する = "自分のタスク一覧を取得する";
export const タスクをルートとしたタスクツリーを取得する = "タスクをルートとしたタスクツリーを取得する";
export const 新しいタスクを追加する = "新しいタスクを追加する";
export const タスクを更新する = "タスクを更新する";
export const タスクをクローズする = "タスクをクローズする";

// PDCA
// weeklyLoop
export const 操作対象の週を変更する = "操作対象の週を変更する";
export const 自分の週次タスクを取得する = "自分の週次タスクを取得する";
export const その週に実施するタスクの貢献度と緊急度を決める = "その週に実施するタスクの貢献度と緊急度を決める";

// dailyLoop
export const 自分のその週のタスク一覧を取得する = "自分のその週のタスク一覧を取得する";
export const 自分のその週のワーク一覧を取得する = "自分のその週のワーク一覧を取得する";
export const 自分のその週のレビュー一覧を取得する = "自分のその週のレビュー一覧を取得する";
export const ワークを追加する = "ワークを追加する";
export const ワークを編集する = "ワークを編集する";
export const ワークをクローズする = "ワークをクローズする";
export const 日次レビューする = "日次レビューする";
export const レビューを編集する = "レビューを編集する";

